<?php
    include_once("../common.php");
    include_once('./inc/header.php');
?>
<div id="gpt_wrap">
    <div class="aside_wrap">
        <?php include_once('./inc/aside.php'); ?>
    </div>
    <div class="chat_wrap">
        <div class="header">
            <h2 class="tit">새 대화</h2>
        </div>
        <div class="container">
            <div class="chat">
                <div class="list">
                    <ul>
                        <li>
                            <div class="lt main">
                                <div class="upper">
                                    <div class="icon"><svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none"><path fill-rule="evenodd" clip-rule="evenodd" d="M10 20C15.5228 20 20 15.5228 20 10C20 4.47715 15.5228 0 10 0C4.47715 0 0 4.47715 0 10C0 15.5228 4.47715 20 10 20ZM10 11C12.2091 11 14 9.20914 14 7C14 4.79086 12.2091 3 10 3C7.79086 3 6 4.79086 6 7C6 9.20914 7.79086 11 10 11ZM17.0885 15.5461C15.441 17.6488 12.8783 19 9.99994 19C7.1216 19 4.55885 17.6488 2.91138 15.5461C3.30469 14.5168 3.97038 13.7226 4.86686 13.1521C6.2895 12.2467 8.15208 12 9.99994 12C11.8478 12 13.7104 12.2467 15.133 13.1521C16.0295 13.7226 16.6952 14.5168 17.0885 15.5461Z" fill="#85837D"></path></svg></div>
                                    <div class="name">나</div>
                                    <div class="option dropdown">
                                        <button type="button" class="dropdown-toggle"><svg width="20" height="20" viewBox="0 0 25 25" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#61605aff"><path fill-rule="evenodd" clip-rule="evenodd" d="M7.5 12.437C7.5 13.5416 6.60457 14.437 5.5 14.437C4.39543 14.437 3.5 13.5416 3.5 12.437C3.5 11.3324 4.39543 10.437 5.5 10.437C6.60457 10.437 7.5 11.3324 7.5 12.437ZM14.5 12.437C14.5 13.5416 13.6046 14.437 12.5 14.437C11.3954 14.437 10.5 13.5416 10.5 12.437C10.5 11.3324 11.3954 10.437 12.5 10.437C13.6046 10.437 14.5 11.3324 14.5 12.437ZM19.5 14.437C20.6046 14.437 21.5 13.5416 21.5 12.437C21.5 11.3324 20.6046 10.437 19.5 10.437C18.3954 10.437 17.5 11.3324 17.5 12.437C17.5 13.5416 18.3954 14.437 19.5 14.437Z" fill="currentColor"></path></svg></button>
                                        <div class="dropdown-menu">
                                            <button type="button">
                                                <svg width="16" height="16" viewBox="0 0 25 25" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#61605aff"><path d="M10.5 18.437C9.95 18.437 9.47917 18.2412 9.0875 17.8495C8.69583 17.4579 8.5 16.987 8.5 16.437V4.43702C8.5 3.88702 8.69583 3.41619 9.0875 3.02452C9.47917 2.63285 9.95 2.43702 10.5 2.43702H18.5C19.05 2.43702 19.5208 2.63285 19.9125 3.02452C20.3042 3.41619 20.5 3.88702 20.5 4.43702V16.437C20.5 16.987 20.3042 17.4579 19.9125 17.8495C19.5208 18.2412 19.05 18.437 18.5 18.437H10.5ZM10.5 16.437H18.5V4.43702H10.5V16.437ZM6.5 22.437C5.95 22.437 5.47917 22.2412 5.0875 21.8495C4.69583 21.4579 4.5 20.987 4.5 20.437V6.43702H6.5V20.437H16.5V22.437H6.5Z" fill="currentColor"></path></svg>
                                                <p>텍스트 복사</p>
                                            </button>
                                            <button type="button">
                                                <svg width="16" height="16" viewBox="0 0 24 24" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#61605aff"><path fill-rule="evenodd" clip-rule="evenodd" d="M3 5C3 3.89543 3.89543 3 5 3H8V5H5L5 19H8V21H5C3.89543 21 3 20.1046 3 19L3 5ZM21 5C21 3.89543 20.1046 3 19 3H16V5H19V19H16V21H19C20.1046 21 21 20.1046 21 19V5ZM8 13C8.55229 13 9 12.5523 9 12C9 11.4477 8.55229 11 8 11C7.44772 11 7 11.4477 7 12C7 12.5523 7.44772 13 8 13ZM13 12C13 12.5523 12.5523 13 12 13C11.4477 13 11 12.5523 11 12C11 11.4477 11.4477 11 12 11C12.5523 11 13 11.4477 13 12ZM16 13C16.5523 13 17 12.5523 17 12C17 11.4477 16.5523 11 16 11C15.4477 11 15 11.4477 15 12C15 12.5523 15.4477 13 16 13Z" fill="currentColor"></path></svg>
                                                <p>프롬프트 저장</p>
                                            </button>
                                        </div>
                                    </div>
                                </div>
                                <div class="text">내가 학회원들 앞에서 "20대가 가져야할 경제관념"에 대해서 발표를 해야해. 발표는 5분 정도이고 슬라이드 5장 정도 만드려고 하는데 장표 제목들과 핵심 스크립트들을 작성해줘</div>
                            </div>
                            <div class="rt references"> </div>
                        </li>
                        <li>
                            <div class="lt main">
                                <div class="upper">
                                    <div class="icon"><svg style="width:100%;height:100%;background:#f72f08ff"></svg></div>
                                    <div class="name">뤼튼</div>
                                    <div class="model"><a href="#">AI 과제와 업무</a></div>
                                </div>
                                <div class="text" id="typedtext"></div>
                            </div>
                            <div class="rt references"> </div>
                        </li>
                    </ul>

                    <script>
                        var aText = new Array(
                            "<p>물론입니다! 5분 발표에 맞춰 슬라이드 5장의 제목과 핵심 스크립트를 작성해드리겠습니다.</p>",
                            "<h4>슬라이드 1: 제목 및 소개</h4>",
                            "<strong>제목: 20대가 가져야할 경제관념</strong>",
                            "<ol>",
                            "<li>• 안녕하세요, 오늘 저는 20대가 가져야 할 경제관념에 대해 이야기하려 합니다.</li>",
                            "<li>• 경제관념은 우리의 삶에 큰 영향을 미치며, 젊은 나이부터 올바른 경제관념을 가지는 것이 중요합니다.</li>",
                            "</ol>",
                            "<h4>슬라이드 2: 예산 관리</h4>",
                            "<strong> 제목: 예산 관리의 중요성</strong>",
                            "<ol>",
                            "<li>• 예산 관리는 재정적인 안정의 첫 걸음입니다.</li>",
                            "<li>• 수입과 지출을 명확히 파악하고, 불필요한 지출을 줄이는 것이 중요합니다.</li>",
                            "<li>• 예산을 세우고 지키는 습관은</li>",
                            "</ol>",
                        );
                        var iSpeed = 0; // time delay of print out
                        var iIndex = 0; // start printing array at this position
                        var iArrLength = aText[1].length; // the length of the text array
                        var iScrollAt = 100; // start scrolling up at this many lines

                        var iTextPos = 0; // initialise text position
                        var sContents = ''; // initialise contents variable
                        var iRow; // initialise current row

                        function typewriter()
                        {
                            sContents =  ' ';
                            iRow = Math.max(0, iIndex-iScrollAt);
                            var destination = document.getElementById("typedtext");

                            while ( iRow < iIndex ) {
                                //sContents += aText[iRow++] + '<br />';
                                sContents += aText[iRow++] + '';
                            }
                            destination.innerHTML = sContents + aText[iIndex].substring(0, iTextPos) + "_";


                            if ( iTextPos++ == iArrLength ) {
                                iTextPos = 0;
                                iIndex++;
                                if ( iIndex != aText.length ) {
                                    iArrLength = aText[iIndex].length;
                                    setTimeout("typewriter()", 0);
                                    window.scrollTo(0, 500);
                                }
                            } else {
                                setTimeout("typewriter()", iSpeed);
                                window.scrollTo(0, 500);
                            }
                        }


                        typewriter();
                        //$("#startBtn").attr("style","display:block");


                    </script>
                </div>
                <div class="bottom">
                    <div class="input">
                        <div class="text"><textarea id="textarea" placeholder="뤼튼에게 무엇이든 물어보세요."></textarea></div>
                        <div class="tool">
                            <div class="lt flex">
                                <div class="attach">
                                    <label>
                                        <input type="file">
                                        <svg width="20" height="20" viewBox="0 0 24 24" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#61605aff"><path fill-rule="evenodd" clip-rule="evenodd" d="M18 5C18.5523 5 19 5.44772 19 6V14.3385L17.6328 12.776C17.0311 12.0884 15.9596 12.0938 15.365 12.7875L13.5049 14.9577L9.54843 10.2818C8.73508 9.32059 7.2465 9.34107 6.45991 10.3243L5 12.1492L5 6C5 5.44772 5.44772 5 6 5H18ZM5 15.3508L5 18C5 18.0002 5 18.0003 5 18.0005C5.00027 18.5509 5.44516 18.9973 5.99497 19H18.005C18.555 18.9973 19 18.5506 19 18L19 17.3757L16.5078 14.5275L14.6413 16.705C14.0402 17.4064 12.9541 17.4029 12.3574 16.6977L8.02165 11.5737L5 15.3508ZM3 14.6492V6C3 4.34315 4.34315 3 6 3H18C19.6569 3 21 4.34315 21 6V16.6243V18C21 19.6569 19.6569 21 18 21H6C5.98706 21 5.97413 20.9999 5.96123 20.9998C5.76765 20.9973 5.57848 20.9765 5.3954 20.9391C4.02835 20.6593 3 19.4497 3 18V18V14.6492Z" fill="currentColor"></path></svg>
                                    </label>
                                </div>
                                <div class="btn prompt">
                                    <svg width="20" height="20" viewBox="0 0 24 24" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#61605aff"><path fill-rule="evenodd" clip-rule="evenodd" d="M4 3C2.89543 3 2 3.89543 2 5V7C2 8.10457 2.89543 9 4 9L4 19C4 20.1046 4.89543 21 6 21H18C19.1046 21 20 20.1046 20 19V9C21.1046 9 22 8.10457 22 7V5C22 3.89543 21.1046 3 20 3H4ZM20 5V7H4V5H20ZM18 9V19H6L6 9H18ZM14 11H10V13H14V11Z" fill="currentColor"></path></svg>
                                </div>
                                <div class="btn code">
                                    <svg width="20" height="20" viewBox="0 0 24 24" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#61605aff"><path fill-rule="evenodd" clip-rule="evenodd" d="M19 5H5L5 19H19V5ZM5 3C3.89543 3 3 3.89543 3 5V19C3 20.1046 3.89543 21 5 21H19C20.1046 21 21 20.1046 21 19V5C21 3.89543 20.1046 3 19 3H5ZM6.64643 10.9394L9.29288 8.29291L10.7071 9.70712L8.4142 12L10.7071 14.2929L9.29288 15.7071L6.64643 13.0607C6.06065 12.4749 6.06065 11.5251 6.64643 10.9394ZM14.7071 8.29291L17.3536 10.9394C17.9394 11.5251 17.9394 12.4749 17.3536 13.0607L14.7071 15.7071L13.2929 14.2929L15.5858 12L13.2929 9.70712L14.7071 8.29291Z" fill="currentColor"></path></svg>
                                </div>
                            </div>
                            <div class="rt flex">
                                <div class="submit"><a href="javascript:;"><svg width="20" height="20" viewBox="0 0 25 25" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#f7f7f5ff"><path fill-rule="evenodd" clip-rule="evenodd" d="M13.3423 7.48727L14.7565 6.07306L19.7063 11.0228L20.0598 11.3764C20.6456 11.9621 20.6456 12.9119 20.0598 13.4977L19.7063 13.8512L14.7565 18.801L13.3423 17.3868L17.2921 13.437L4.50082 13.437V11.437L17.2921 11.437L13.3423 7.48727Z" fill="currentColor"></path></svg></a></div>
                            </div>
                            <script>
                                const DEFAULT_HEIGHT = 26;
                                const $textarea = document.querySelector('#textarea');
                                $textarea.oninput = (event) => {
                                    const $target = event.target;
                                    $target.style.height = 0;
                                    $target.style.height = DEFAULT_HEIGHT + $target.scrollHeight + 'px';
                                };
                            </script>
                        </div>
                    </div>
                </div>
            </div>
            <div class="resources">
                <div class="title">참고자료</div>
                <div class="list">
                    <ul>
                        <li>
                            <div class="sub">
                                <svg width="18" height="18" viewBox="0 0 25 25" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#1a1918ff"><path fill-rule="evenodd" clip-rule="evenodd" d="M8.58002 14.437C8.52754 13.7908 8.5 13.1219 8.5 12.437C8.5 11.7521 8.52754 11.0832 8.58002 10.437H4.75204C4.58751 11.0763 4.5 11.7464 4.5 12.437C4.5 13.1276 4.58751 13.7978 4.75204 14.437H8.58002ZM8.83284 16.437H5.57026C6.52529 18.088 8.05338 19.366 9.88254 19.999C9.43442 19.0287 9.07343 17.8137 8.83284 16.437ZM10.8667 16.437H14.1333C13.9597 17.3255 13.7329 18.1117 13.4715 18.7653C13.1653 19.5307 12.8508 20.0158 12.6039 20.2769C12.5635 20.3196 12.5289 20.3525 12.5 20.3777C12.4711 20.3525 12.4365 20.3196 12.3961 20.2769C12.1492 20.0158 11.8347 19.5307 11.5285 18.7653C11.2671 18.1117 11.0403 17.3255 10.8667 16.437ZM14.4128 14.437H10.5872C10.5306 13.7997 10.5 13.1306 10.5 12.437C10.5 11.7435 10.5306 11.0743 10.5872 10.437H14.4128C14.4694 11.0743 14.5 11.7435 14.5 12.437C14.5 13.1306 14.4694 13.7997 14.4128 14.437ZM16.1672 16.437C15.9266 17.8137 15.5656 19.0287 15.1175 19.999C16.9466 19.366 18.4747 18.088 19.4297 16.437H16.1672ZM20.248 14.437H16.42C16.4725 13.7908 16.5 13.1219 16.5 12.437C16.5 11.7521 16.4725 11.0832 16.42 10.437H20.248C20.4125 11.0763 20.5 11.7464 20.5 12.437C20.5 13.1276 20.4125 13.7978 20.248 14.437ZM11.5285 6.10873C11.2671 6.76232 11.0403 7.54853 10.8667 8.43701H14.1333C13.9597 7.54853 13.7329 6.76232 13.4715 6.10873C13.1653 5.34335 12.8508 4.85819 12.6039 4.59708C12.5635 4.55442 12.5289 4.52152 12.5 4.4963C12.4711 4.52152 12.4365 4.55442 12.3961 4.59708C12.1492 4.85819 11.8347 5.34335 11.5285 6.10873ZM16.1672 8.43701H19.4297C18.4747 6.78605 16.9466 5.50805 15.1175 4.87502C15.5656 5.84529 15.9266 7.06035 16.1672 8.43701ZM5.57026 8.43701H8.83284C9.07343 7.06035 9.43442 5.84529 9.88254 4.87502C8.05338 5.50805 6.52529 6.78604 5.57026 8.43701ZM12.5 2.43701C18.0228 2.43701 22.5 6.91416 22.5 12.437C22.5 17.9599 18.0228 22.437 12.5 22.437C6.97715 22.437 2.5 17.9599 2.5 12.437C2.5 6.91416 6.97715 2.43701 12.5 2.43701Z" fill="currentColor"></path></svg>
                                <p>네이버 포스트</p>
                            </div>
                            <div class="tit">사회복지서비스란?</div>
                            <div class="txt">사회복지 서비스는 개인이나 집단이 기본적인 생활을 영위하고, 사회적 참여를 증진하며, 삶의 질을 향상시키기 위해 제공되는 다양한 지원과 서비스를 말합니다. 이 서비스는 일반적으로 다음과 같은 영역에서 이루어집니다. 소득 지원: 저소득층이나 실업자에게 경제적 지원을 제공하여 기본적인 생활을 유지할 수 있도록 돕습니다. 주거 지원: 저소득 가구를 위한 주거지 제공, 주택 보조금 등 주거 안정성을 강화하는 서비스입니다. 의료 서비스: 의료 접근성을 높이기 위해 저소득층에게 의료비 지원, 건강 상담 및 예방 프로그램을 제공합니다. 정신건강 서비스: 정신적 어려움을 겪고 있는 개인을 위한 상담, 치료 및 지원 프로그램을 포함합니다. 아동 및 청소년 서비스: 아동의 보호와 발달을 지원하고, 청소년의 건강한 성장과 사회적 참여를 촉진하는 프로그램입니다. 노인 복지: 노인들이 건강하게 생활할 수 있도록 지원하고, 사회적 고립을 예방하기 위한 다양한 프로그램을 제공합니다. 장애인 서비스: 장애인의 자립과 사회 참여를 촉진하기 위한 맞춤형 지원과 서비스입니다. 이러한 서비스는 정부, 비영리 단체, 지역 사회 및 자원봉사자들에 의해 제공되며, 각 개인의 필요에 맞추어 다양한 형태로 이루어집니다. 사회복지 서비스는 사회적 연대와 평등을 강조하며, 모든 사람이 기본적인 권리를 누릴 수 있도록 돕는 중요한 역할을 합니다.</div>
                        </li>
                        <li>
                            <div class="sub">
                                <svg width="18" height="18" viewBox="0 0 25 25" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#1a1918ff"><path fill-rule="evenodd" clip-rule="evenodd" d="M8.58002 14.437C8.52754 13.7908 8.5 13.1219 8.5 12.437C8.5 11.7521 8.52754 11.0832 8.58002 10.437H4.75204C4.58751 11.0763 4.5 11.7464 4.5 12.437C4.5 13.1276 4.58751 13.7978 4.75204 14.437H8.58002ZM8.83284 16.437H5.57026C6.52529 18.088 8.05338 19.366 9.88254 19.999C9.43442 19.0287 9.07343 17.8137 8.83284 16.437ZM10.8667 16.437H14.1333C13.9597 17.3255 13.7329 18.1117 13.4715 18.7653C13.1653 19.5307 12.8508 20.0158 12.6039 20.2769C12.5635 20.3196 12.5289 20.3525 12.5 20.3777C12.4711 20.3525 12.4365 20.3196 12.3961 20.2769C12.1492 20.0158 11.8347 19.5307 11.5285 18.7653C11.2671 18.1117 11.0403 17.3255 10.8667 16.437ZM14.4128 14.437H10.5872C10.5306 13.7997 10.5 13.1306 10.5 12.437C10.5 11.7435 10.5306 11.0743 10.5872 10.437H14.4128C14.4694 11.0743 14.5 11.7435 14.5 12.437C14.5 13.1306 14.4694 13.7997 14.4128 14.437ZM16.1672 16.437C15.9266 17.8137 15.5656 19.0287 15.1175 19.999C16.9466 19.366 18.4747 18.088 19.4297 16.437H16.1672ZM20.248 14.437H16.42C16.4725 13.7908 16.5 13.1219 16.5 12.437C16.5 11.7521 16.4725 11.0832 16.42 10.437H20.248C20.4125 11.0763 20.5 11.7464 20.5 12.437C20.5 13.1276 20.4125 13.7978 20.248 14.437ZM11.5285 6.10873C11.2671 6.76232 11.0403 7.54853 10.8667 8.43701H14.1333C13.9597 7.54853 13.7329 6.76232 13.4715 6.10873C13.1653 5.34335 12.8508 4.85819 12.6039 4.59708C12.5635 4.55442 12.5289 4.52152 12.5 4.4963C12.4711 4.52152 12.4365 4.55442 12.3961 4.59708C12.1492 4.85819 11.8347 5.34335 11.5285 6.10873ZM16.1672 8.43701H19.4297C18.4747 6.78605 16.9466 5.50805 15.1175 4.87502C15.5656 5.84529 15.9266 7.06035 16.1672 8.43701ZM5.57026 8.43701H8.83284C9.07343 7.06035 9.43442 5.84529 9.88254 4.87502C8.05338 5.50805 6.52529 6.78604 5.57026 8.43701ZM12.5 2.43701C18.0228 2.43701 22.5 6.91416 22.5 12.437C22.5 17.9599 18.0228 22.437 12.5 22.437C6.97715 22.437 2.5 17.9599 2.5 12.437C2.5 6.91416 6.97715 2.43701 12.5 2.43701Z" fill="currentColor"></path></svg>
                                <p>네이버 포스트</p>
                            </div>
                            <div class="tit">사회복지서비스란?</div>
                            <div class="txt">사회복지 서비스는 개인이나 집단이 기본적인 생활을 영위하고, 사회적 참여를 증진하며, 삶의 질을 향상시키기 위해 제공되는 다양한 지원과 서비스를 말합니다. 이 서비스는 일반적으로 다음과 같은 영역에서 이루어집니다. 소득 지원: 저소득층이나 실업자에게 경제적 지원을 제공하여 기본적인 생활을 유지할 수 있도록 돕습니다. 주거 지원: 저소득 가구를 위한 주거지 제공, 주택 보조금 등 주거 안정성을 강화하는 서비스입니다. 의료 서비스: 의료 접근성을 높이기 위해 저소득층에게 의료비 지원, 건강 상담 및 예방 프로그램을 제공합니다. 정신건강 서비스: 정신적 어려움을 겪고 있는 개인을 위한 상담, 치료 및 지원 프로그램을 포함합니다. 아동 및 청소년 서비스: 아동의 보호와 발달을 지원하고, 청소년의 건강한 성장과 사회적 참여를 촉진하는 프로그램입니다. 노인 복지: 노인들이 건강하게 생활할 수 있도록 지원하고, 사회적 고립을 예방하기 위한 다양한 프로그램을 제공합니다. 장애인 서비스: 장애인의 자립과 사회 참여를 촉진하기 위한 맞춤형 지원과 서비스입니다. 이러한 서비스는 정부, 비영리 단체, 지역 사회 및 자원봉사자들에 의해 제공되며, 각 개인의 필요에 맞추어 다양한 형태로 이루어집니다. 사회복지 서비스는 사회적 연대와 평등을 강조하며, 모든 사람이 기본적인 권리를 누릴 수 있도록 돕는 중요한 역할을 합니다.</div>
                        </li>
                        <li>
                            <div class="sub">
                                <svg width="18" height="18" viewBox="0 0 25 25" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#1a1918ff"><path fill-rule="evenodd" clip-rule="evenodd" d="M8.58002 14.437C8.52754 13.7908 8.5 13.1219 8.5 12.437C8.5 11.7521 8.52754 11.0832 8.58002 10.437H4.75204C4.58751 11.0763 4.5 11.7464 4.5 12.437C4.5 13.1276 4.58751 13.7978 4.75204 14.437H8.58002ZM8.83284 16.437H5.57026C6.52529 18.088 8.05338 19.366 9.88254 19.999C9.43442 19.0287 9.07343 17.8137 8.83284 16.437ZM10.8667 16.437H14.1333C13.9597 17.3255 13.7329 18.1117 13.4715 18.7653C13.1653 19.5307 12.8508 20.0158 12.6039 20.2769C12.5635 20.3196 12.5289 20.3525 12.5 20.3777C12.4711 20.3525 12.4365 20.3196 12.3961 20.2769C12.1492 20.0158 11.8347 19.5307 11.5285 18.7653C11.2671 18.1117 11.0403 17.3255 10.8667 16.437ZM14.4128 14.437H10.5872C10.5306 13.7997 10.5 13.1306 10.5 12.437C10.5 11.7435 10.5306 11.0743 10.5872 10.437H14.4128C14.4694 11.0743 14.5 11.7435 14.5 12.437C14.5 13.1306 14.4694 13.7997 14.4128 14.437ZM16.1672 16.437C15.9266 17.8137 15.5656 19.0287 15.1175 19.999C16.9466 19.366 18.4747 18.088 19.4297 16.437H16.1672ZM20.248 14.437H16.42C16.4725 13.7908 16.5 13.1219 16.5 12.437C16.5 11.7521 16.4725 11.0832 16.42 10.437H20.248C20.4125 11.0763 20.5 11.7464 20.5 12.437C20.5 13.1276 20.4125 13.7978 20.248 14.437ZM11.5285 6.10873C11.2671 6.76232 11.0403 7.54853 10.8667 8.43701H14.1333C13.9597 7.54853 13.7329 6.76232 13.4715 6.10873C13.1653 5.34335 12.8508 4.85819 12.6039 4.59708C12.5635 4.55442 12.5289 4.52152 12.5 4.4963C12.4711 4.52152 12.4365 4.55442 12.3961 4.59708C12.1492 4.85819 11.8347 5.34335 11.5285 6.10873ZM16.1672 8.43701H19.4297C18.4747 6.78605 16.9466 5.50805 15.1175 4.87502C15.5656 5.84529 15.9266 7.06035 16.1672 8.43701ZM5.57026 8.43701H8.83284C9.07343 7.06035 9.43442 5.84529 9.88254 4.87502C8.05338 5.50805 6.52529 6.78604 5.57026 8.43701ZM12.5 2.43701C18.0228 2.43701 22.5 6.91416 22.5 12.437C22.5 17.9599 18.0228 22.437 12.5 22.437C6.97715 22.437 2.5 17.9599 2.5 12.437C2.5 6.91416 6.97715 2.43701 12.5 2.43701Z" fill="currentColor"></path></svg>
                                <p>네이버 포스트</p>
                            </div>
                            <div class="tit">사회복지서비스란?</div>
                            <div class="txt">사회복지 서비스는 개인이나 집단이 기본적인 생활을 영위하고, 사회적 참여를 증진하며, 삶의 질을 향상시키기 위해 제공되는 다양한 지원과 서비스를 말합니다. 이 서비스는 일반적으로 다음과 같은 영역에서 이루어집니다. 소득 지원: 저소득층이나 실업자에게 경제적 지원을 제공하여 기본적인 생활을 유지할 수 있도록 돕습니다. 주거 지원: 저소득 가구를 위한 주거지 제공, 주택 보조금 등 주거 안정성을 강화하는 서비스입니다. 의료 서비스: 의료 접근성을 높이기 위해 저소득층에게 의료비 지원, 건강 상담 및 예방 프로그램을 제공합니다. 정신건강 서비스: 정신적 어려움을 겪고 있는 개인을 위한 상담, 치료 및 지원 프로그램을 포함합니다. 아동 및 청소년 서비스: 아동의 보호와 발달을 지원하고, 청소년의 건강한 성장과 사회적 참여를 촉진하는 프로그램입니다. 노인 복지: 노인들이 건강하게 생활할 수 있도록 지원하고, 사회적 고립을 예방하기 위한 다양한 프로그램을 제공합니다. 장애인 서비스: 장애인의 자립과 사회 참여를 촉진하기 위한 맞춤형 지원과 서비스입니다. 이러한 서비스는 정부, 비영리 단체, 지역 사회 및 자원봉사자들에 의해 제공되며, 각 개인의 필요에 맞추어 다양한 형태로 이루어집니다. 사회복지 서비스는 사회적 연대와 평등을 강조하며, 모든 사람이 기본적인 권리를 누릴 수 있도록 돕는 중요한 역할을 합니다.</div>
                        </li>
                        <li>
                            <div class="sub">
                                <svg width="18" height="18" viewBox="0 0 25 25" fill="currentColor" xmlns="http://www.w3.org/2000/svg" color="#1a1918ff"><path fill-rule="evenodd" clip-rule="evenodd" d="M8.58002 14.437C8.52754 13.7908 8.5 13.1219 8.5 12.437C8.5 11.7521 8.52754 11.0832 8.58002 10.437H4.75204C4.58751 11.0763 4.5 11.7464 4.5 12.437C4.5 13.1276 4.58751 13.7978 4.75204 14.437H8.58002ZM8.83284 16.437H5.57026C6.52529 18.088 8.05338 19.366 9.88254 19.999C9.43442 19.0287 9.07343 17.8137 8.83284 16.437ZM10.8667 16.437H14.1333C13.9597 17.3255 13.7329 18.1117 13.4715 18.7653C13.1653 19.5307 12.8508 20.0158 12.6039 20.2769C12.5635 20.3196 12.5289 20.3525 12.5 20.3777C12.4711 20.3525 12.4365 20.3196 12.3961 20.2769C12.1492 20.0158 11.8347 19.5307 11.5285 18.7653C11.2671 18.1117 11.0403 17.3255 10.8667 16.437ZM14.4128 14.437H10.5872C10.5306 13.7997 10.5 13.1306 10.5 12.437C10.5 11.7435 10.5306 11.0743 10.5872 10.437H14.4128C14.4694 11.0743 14.5 11.7435 14.5 12.437C14.5 13.1306 14.4694 13.7997 14.4128 14.437ZM16.1672 16.437C15.9266 17.8137 15.5656 19.0287 15.1175 19.999C16.9466 19.366 18.4747 18.088 19.4297 16.437H16.1672ZM20.248 14.437H16.42C16.4725 13.7908 16.5 13.1219 16.5 12.437C16.5 11.7521 16.4725 11.0832 16.42 10.437H20.248C20.4125 11.0763 20.5 11.7464 20.5 12.437C20.5 13.1276 20.4125 13.7978 20.248 14.437ZM11.5285 6.10873C11.2671 6.76232 11.0403 7.54853 10.8667 8.43701H14.1333C13.9597 7.54853 13.7329 6.76232 13.4715 6.10873C13.1653 5.34335 12.8508 4.85819 12.6039 4.59708C12.5635 4.55442 12.5289 4.52152 12.5 4.4963C12.4711 4.52152 12.4365 4.55442 12.3961 4.59708C12.1492 4.85819 11.8347 5.34335 11.5285 6.10873ZM16.1672 8.43701H19.4297C18.4747 6.78605 16.9466 5.50805 15.1175 4.87502C15.5656 5.84529 15.9266 7.06035 16.1672 8.43701ZM5.57026 8.43701H8.83284C9.07343 7.06035 9.43442 5.84529 9.88254 4.87502C8.05338 5.50805 6.52529 6.78604 5.57026 8.43701ZM12.5 2.43701C18.0228 2.43701 22.5 6.91416 22.5 12.437C22.5 17.9599 18.0228 22.437 12.5 22.437C6.97715 22.437 2.5 17.9599 2.5 12.437C2.5 6.91416 6.97715 2.43701 12.5 2.43701Z" fill="currentColor"></path></svg>
                                <p>네이버 포스트</p>
                            </div>
                            <div class="tit">사회복지서비스란?</div>
                            <div class="txt">사회복지 서비스는 개인이나 집단이 기본적인 생활을 영위하고, 사회적 참여를 증진하며, 삶의 질을 향상시키기 위해 제공되는 다양한 지원과 서비스를 말합니다. 이 서비스는 일반적으로 다음과 같은 영역에서 이루어집니다. 소득 지원: 저소득층이나 실업자에게 경제적 지원을 제공하여 기본적인 생활을 유지할 수 있도록 돕습니다. 주거 지원: 저소득 가구를 위한 주거지 제공, 주택 보조금 등 주거 안정성을 강화하는 서비스입니다. 의료 서비스: 의료 접근성을 높이기 위해 저소득층에게 의료비 지원, 건강 상담 및 예방 프로그램을 제공합니다. 정신건강 서비스: 정신적 어려움을 겪고 있는 개인을 위한 상담, 치료 및 지원 프로그램을 포함합니다. 아동 및 청소년 서비스: 아동의 보호와 발달을 지원하고, 청소년의 건강한 성장과 사회적 참여를 촉진하는 프로그램입니다. 노인 복지: 노인들이 건강하게 생활할 수 있도록 지원하고, 사회적 고립을 예방하기 위한 다양한 프로그램을 제공합니다. 장애인 서비스: 장애인의 자립과 사회 참여를 촉진하기 위한 맞춤형 지원과 서비스입니다. 이러한 서비스는 정부, 비영리 단체, 지역 사회 및 자원봉사자들에 의해 제공되며, 각 개인의 필요에 맞추어 다양한 형태로 이루어집니다. 사회복지 서비스는 사회적 연대와 평등을 강조하며, 모든 사람이 기본적인 권리를 누릴 수 있도록 돕는 중요한 역할을 합니다.</div>
                        </li>
                    </ul>
                </div>
            </div>
        </div>
    </div>
</div>
<?php
    include_once('./inc/footer.php');
?>

